Repository: afgmen/Odaai-POS-v1
Catalog: lib/l10n/app_*.arb
Languages: ko, vi

# excelExporting
source: Creating Excel file...
ko: 엑셀 파일 생성 중...
vi: Đang tạo tệp Excel...

# excelSaveComplete
source: Excel file saved!
ko: 엑셀 파일 저장 완료!
vi: Đã lưu tệp Excel!

# excelSaveFailed
source: Save cancelled or failed. Please try again.
ko: 저장 취소 또는 실패. 다시 시도하세요.
vi: Lưu bị hủy hoặc thất bại. Vui lòng thử lại.

# excelFileSave
source: Save Excel File
ko: 엑셀 파일 저장
vi: Lưu tệp Excel

# excelFileSelect
source: Select Excel File
ko: 엑셀 파일 선택
vi: Chọn tệp Excel

source: Upload Complete
ko: 업로드 완료
vi: Tải lên hoàn tất

# newProductAdded
source: New Products Added
ko: 새 상품 추가
vi: Sản phẩm mới đã thêm

# existingProductUpdated
source: Existing Products Updated
ko: 기존 상품 수정
vi: Sản phẩm đã cập nhật

source: Total Processed
ko: 총 처리 건수
vi: Tổng đã xử lý

# countUnit
source: {count} items
ko: {count}건
vi: {count} mục

# errorsOccurred
source: ⚠️ {count} errors occurred
ko: ⚠️ {count}건 오류 발생
vi: ⚠️ {count} lỗi đã xảy ra

# productDeleted
source: '{name}' has been deleted
ko: '{name}'이(가) 삭제되었습니다
vi: '{name}' đã bị xóa

# errorPrefix
source: Error: {error}
ko: 오류: {error}
vi: Lỗi: {error}

source: No products found
ko: 상품이 없습니다
vi: Không tìm thấy sản phẩm

source: Category
ko: 카테고리
vi: Danh mục

source: Selling Price
ko: 판매가
vi: Giá bán

# costPrice
source: Cost
ko: 원가
vi: Giá vốn

source: Stock
ko: 재고
vi: Tồn kho

source: Min Stock
ko: 최소재고
vi: Tồn kho tối thiểu

source: Action
ko: 액션
vi: Thao tác

# statusOutOfStock
source: Out of Stock
ko: 품절
vi: Hết hàng

# statusLow
source: Low
ko: 잔재고
vi: Thấp

# statusNormal
source: Normal
ko: 정상
vi: Bình thường

source: Stock Adjust
ko: 재고 조정
vi: Điều chỉnh kho

source: Basic Info
ko: 기본정보
vi: Thông tin cơ bản

# productNameRequired
source: Product Name *
ko: 상품명 *
vi: Tên sản phẩm *

source: Price Info
ko: 가격정보
vi: Thông tin giá

# sellingPriceRequired
source: Selling Price *
ko: 판매가 *
vi: Giá bán *

source: Stock Info
ko: 재고정보
vi: Thông tin tồn kho

source: Stock Quantity
ko: 재고수량
vi: Số lượng tồn kho

# categoryHint
source: Food, Beverage, Electronics, etc.
ko: 식품, 음료, 전자제품 등
vi: Thực phẩm, Đồ uống, Điện tử, v.v.

# productUpdated
source: Product has been updated
ko: 상품이 수정되었습니다
vi: Đã cập nhật sản phẩm

# productAdded
source: Product has been added
ko: 상품이 추가되었습니다
vi: Đã thêm sản phẩm

source: Product Image
vi: Hình ảnh sản phẩm

source: No image
vi: Không có hình ảnh

source: Camera
vi: Máy ảnh

source: Gallery
vi: Thư viện

source: AI Auto Search
vi: Tìm kiếm tự động AI

source: AI Image Search
vi: Tìm kiếm hình ảnh AI

source: AI Image Search Complete
vi: Hoàn tất tìm kiếm hình ảnh AI

source: Image uploaded
vi: Đã tải lên hình ảnh

source: Delete Image
vi: Xóa hình ảnh

# deleteImageConfirm
source: Do you really want to delete this image?
vi: Bạn có thực sự muốn xóa hình ảnh này không?

source: Image deleted
vi: Đã xóa hình ảnh

# imageSetByAi
source: Image set by AI search
vi: Hình ảnh được đặt bởi tìm kiếm AI

# imageDownloadFailed
source: Image download failed: {error}
vi: Tải hình ảnh thất bại: {error}

# noProductsWithoutImage
source: No products without images
vi: Không có sản phẩm nào không có hình ảnh

source: Searching...
vi: Đang tìm kiếm...

source: Search failed
vi: Tìm kiếm thất bại

source: No search results
vi: Không có kết quả tìm kiếm

# noImagesFound
source: No images found for "{product}"
vi: Không tìm thấy hình ảnh cho "{product}"

source: Search: {query}
vi: Tìm kiếm: {query}

source: Success
vi: Thành công

source: Failed
vi: Thất bại

source: Success Rate
vi: Tỷ lệ thành công

# failedProducts
source: Failed Products ({count})
vi: Sản phẩm thất bại ({count})

source: Image
vi: Hình ảnh

source: unit
vi: đơn vị

# deleteProductTitle
source: Delete Product
ko: 상품 삭제
vi: Xóa sản phẩm

# deleteProductConfirm
source: Delete '{name}'? This action cannot be undone.
ko: '{name}'을(를) 삭제하겠습니까? 삭제된 상품은 복원할 수 없습니다.
vi: Xóa '{name}'? Hành động này không thể hoàn tác.

source: Receipt
ko: 영수증
vi: Hóa đơn

source: Print
ko: 인쇄
vi: In

# orderNumber
source: Order #
ko: 주문번호
vi: Mã đơn hàng

source: Unit Price
ko: 단가
vi: Đơn giá

# cashPaidAmount
source: Paid Amount
ko: 투입금액
vi: Số tiền đã trả

# thankYouMessage
source: Thank you for your purchase!
ko: 이용해 주셔서 감사합니다!
vi: Cảm ơn quý khách!

source: New Order
ko: 새 주문
vi: Đơn hàng mới

source: Receipt Print
ko: 영수증 인쇄
vi: In hóa đơn

source: Paper Format
ko: 용지 형식
vi: Khổ giấy

# receiptFormat
source: Receipt (80mm)
ko: 영수증 (80mm)
vi: Hóa đơn (80mm)

# thermalPrinter
source: For thermal printer
ko: 열감지 프린터용
vi: Dùng cho máy in nhiệt

# regularPrinter
source: For regular printer
ko: 일반 프린터용
vi: Dùng cho máy in thường

source: Preview
ko: 미리보기
vi: Xem trước

source: Printing...
ko: 인쇄 중...
vi: Đang in...

source: Receipt Preview
ko: 영수증 미리보기
vi: Xem trước hóa đơn

# receiptFileName
source: Receipt_{saleNumber}.pdf
ko: 영수증_{saleNumber}.pdf
vi: HoaDon_{saleNumber}.pdf

# printError
source: Print error: {error}
ko: 인쇄 오류: {error}
vi: Lỗi in: {error}

source: Stock Adjustment
ko: 재고 조정
vi: Điều chỉnh tồn kho

# currentStockAmount
source: Current Stock
ko: 현재 재고
vi: Tồn kho hiện tại

source: Adjustment Type
ko: 조정 유형
vi: Loại điều chỉnh

# stockIn
source: + Receive
ko: + 입고
vi: + Nhập kho

# stockOut
source: - Dispatch
ko: - 출고
vi: - Xuất kho

# adjustmentQuantity
source: Adjustment Qty
ko: 조정 수량
vi: Số lượng điều chỉnh

source: Enter quantity
ko: 수량 입력
vi: Nhập số lượng

source: Reason (optional)
ko: 사유 (선택)
vi: Lý do (tùy chọn)

# reasonHint
source: e.g. New stock, Loss, etc.
ko: 예: 신규 입고, 손실 등
vi: VD: Nhập hàng mới, Hao hụt, v.v.

# stockAfterAdjust
source: Stock After Adjustment
ko: 조정 후 재고
vi: Tồn kho sau điều chỉnh

# adjustComplete
source: Complete
ko: 조정 완료
vi: Hoàn tất

# stockAdjusted
source: Stock adjusted ({change})
ko: 재고가 조정되었습니다 ({change}개)
vi: Đã điều chỉnh tồn kho ({change})

source: Barcode / SKU Input
ko: 바코드 / SKU 입력
vi: Nhập mã vạch / SKU

source: Barcode or SKU
ko: 바코드 또는 SKU
vi: Mã vạch hoặc SKU

source: Lookup
ko: 조회
vi: Tra cứu

source: Continuous Scan Mode
ko: 연속 스캔 모드
vi: Chế độ quét liên tục

source: — Auto-reset after input
ko: — 입력 후 자동 초기화
vi: — Tự động đặt lại sau khi nhập

# barcodeScannerHelp
source: Automatically looks up when USB barcode scanner is connected.
ko: USB 바코드 스캔기 연결 시 스캔 후 자동으로 조회됩니다.
vi: Tự động tra cứu khi kết nối máy quét mã vạch USB.

# addedToCartMsg
source: ✓ {name} — Added to cart
ko: ✓ {name} — 장바구니에 추가
vi: ✓ {name} — Đã thêm vào giỏ

# outOfStockMsg
source: ✗ {name} — Currently out of stock
ko: ✗ {name} — 현재 품절 중
vi: ✗ {name} — Hiện đã hết hàng

# productNotFoundMsg
source: ✗ [{input}] Product not found
ko: ✗ [{input}] 상품을 찾을 수 없습니다
vi: ✗ [{input}] Không tìm thấy sản phẩm

# excelSheetProductList
source: Product List
ko: 상품목록
vi: Danh sách sản phẩm

# excelHeaderProductName
source: Product Name
ko: 상품명
vi: Tên sản phẩm

# excelHeaderBarcode
source: Barcode
ko: 바코드
vi: Mã vạch

# excelHeaderCategory
source: Category
ko: 카테고리
vi: Danh mục

# excelHeaderSellingPrice
source: Selling Price
ko: 판매가
vi: Giá bán

# excelHeaderCostPrice
source: Cost
ko: 원가
vi: Giá vốn

# excelHeaderStock
source: Stock
ko: 재고
vi: Tồn kho

# excelHeaderMinStock
source: Min Stock
ko: 최소재고
vi: Tồn kho tối thiểu

# excelRowNameEmpty
source: Row {row}: Product name is empty
ko: 행 {row}: 상품명이 비어있습니다
vi: Hàng {row}: Tên sản phẩm trống

# excelRowPriceError
source: Row {row}: Selling price must be 0 or greater
ko: 행 {row}: 판매가는 0 이상이어야 합니다
vi: Hàng {row}: Giá bán phải từ 0 trở lên

# excelRowCostError
source: Row {row}: Cost must be 0 or greater
ko: 행 {row}: 원가는 0 이상이어야 합니다
vi: Hàng {row}: Giá vốn phải từ 0 trở lên

# excelRowStockError
source: Row {row}: Stock must be 0 or greater
ko: 행 {row}: 재고는 0 이상이어야 합니다
vi: Hàng {row}: Tồn kho phải từ 0 trở lên

# excelRowError
source: Row {row}: {error}
ko: 행 {row}: {error}
vi: Hàng {row}: {error}

# insufficientStockError
source: Insufficient stock. Current: {stock}
ko: 재고가 부족합니다. 현재 재고: {stock}
vi: Không đủ hàng tồn kho. Hiện tại: {stock}

# saleReason
source: Sale
ko: 판매
vi: Bán hàng

source: Refund stock restore
ko: 환불 재고 복구
vi: Hoàn trả tồn kho do hoàn tiền

source: Partial refund stock restore
ko: 부분 환불 재고 복구
vi: Hoàn trả tồn kho do hoàn tiền một phần

# reportSheetSummary
source: Summary
ko: 요약
vi: Tổng quan

# reportTitle
source: Oda POS Sales Report
ko: Oda POS 매출 리포트
vi: Báo cáo doanh thu Oda POS

# reportPeriod
source: Period: {from} ~ {to}
ko: 기간: {from} ~ {to}
vi: Kỳ: {from} ~ {to}

# reportItem
source: Item
ko: 항목
vi: Mục

# reportValue
source: Value
ko: 값
vi: Giá trị

# reportTotalSales
source: Total Sales
ko: 총 매출
vi: Tổng doanh thu

# reportOrderCount
source: Orders
ko: 주문 수
vi: Số đơn hàng

# reportAvgOrder
source: Avg. Order Amount
ko: 평균 주문금액
vi: Giá trị đơn trung bình

# reportGrowthRate
source: Growth Rate (%)
ko: 성장률 (%)
vi: Tốc độ tăng trưởng (%)

# reportSheetDaily
source: Daily Sales
ko: 일별 매출
vi: Doanh thu theo ngày

# reportDate
source: Date
ko: 날짜
vi: Ngày

# reportSales
source: Sales
ko: 매출
vi: Doanh thu

# reportSheetPayment
source: By Payment Method
ko: 결제 방법별
vi: Theo phương thức thanh toán

# reportSheetProduct
source: Product Sales
ko: 상품별 매출
vi: Doanh thu theo sản phẩm

# reportRank
source: Rank
ko: 순위
vi: Xếp hạng

# reportQuantitySold
source: Qty Sold
ko: 판매 수량
vi: SL đã bán

# employeeInfoEdit
source: Edit employee info. Enter a new 4-digit number to change PIN.
ko: 직원 정보를 수정합니다. PIN을 변경하려면 새로운 4자리 숫자를 입력하세요.
vi: Chỉnh sửa thông tin nhân viên. Nhập số 4 chữ số mới để đổi PIN.

# employeeInfoNew
source: A new employee will be created. They can log in using the PIN.
ko: 새 직원이 생성됩니다. PIN을 사용하여 로그인할 수 있습니다.
vi: Nhân viên mới sẽ được tạo. Họ có thể đăng nhập bằng PIN.

source: Barcode
ko: 바코드
vi: Mã vạch

# categoryAll
source: All
ko: 전체
vi: Tất cả

# categoryFood
source: Food
ko: 식품
vi: Thực phẩm

# categoryBeverage
source: Beverage
ko: 음료
vi: Đồ uống

# categoryElectronics
source: Electronics
ko: 전자제품
vi: Điện tử

# categoryDaily
source: Daily Goods
ko: 일용품
vi: Hàng hóa hàng ngày

# kdsTitle
source: Kitchen Display System
ko: 주방 디스플레이 시스템
vi: Hệ thống Hiển thị Nhà bếp

# kdsCompleted
source: Completed
ko: 완료
vi: Hoàn thành

# kdsInProgress
source: In Progress
ko: 진행중
vi: Đang xử lý

# kdsAverage
source: Average
ko: 평균
vi: Trung bình

# kdsMinutes
source: {count}min {seconds}sec
ko: {count}분 {seconds}초
vi: {count} phút {seconds} giây

# kdsOrdersCount
source: {count} orders
ko: {count}건
vi: {count} đơn

# kdsStatusPending
source: Pending
ko: 대기
vi: Chờ xử lý

# kdsStatusPreparing
source: Preparing
ko: 조리중
vi: Đang chuẩn bị

# kdsStatusReady
source: Ready
ko: 완료
vi: Sẵn sàng

# kdsStatusServed
source: Served
ko: 서빙완료
vi: Đã phục vụ

# kdsStatusCancelled
source: Cancelled
ko: 취소
vi: Đã hủy

# kdsPriorityNormal
source: Normal
ko: 일반
vi: Bình thường

# kdsPriorityUrgent
source: Urgent
ko: 긴급
vi: Khẩn cấp

# kdsFilterAll
source: All
ko: 전체
vi: Tất cả

# kdsFilterPending
source: Pending
ko: 대기
vi: Chờ xử lý

# kdsFilterPreparing
source: Preparing
ko: 조리중
vi: Đang chuẩn bị

# kdsFilterReady
source: Ready
ko: 완료
vi: Sẵn sàng

# kdsNoOrders
source: No orders
ko: 주문이 없습니다
vi: Không có đơn hàng

# kdsErrorOccurred
source: Error occurred: {error}
ko: 오류 발생: {error}
vi: Đã xảy ra lỗi: {error}

# kdsTakeout
source: Takeout #{id}
ko: 포장 #{id}
vi: Mang đi #{id}

# kdsOrderTime
source: Order Time
ko: 주문 시간
vi: Thời gian đặt hàng

# kdsStatus
source: Status
ko: 상태
vi: Trạng thái

# kdsPriority
source: Priority
ko: 우선순위
vi: Ưu tiên

# kdsSpecialRequest
source: Special Request
ko: 특별 요청
vi: Yêu cầu đặc biệt

# kdsProcessingHistory
source: Processing History
ko: 처리 내역
vi: Lịch sử xử lý

# kdsCancelOrder
source: Cancel Order
ko: 취소
vi: Hủy

# kdsCancelOrderConfirm
source: Are you sure you want to cancel this order?
ko: 주문을 취소하시겠습니까?
vi: Bạn có chắc chắn muốn hủy đơn hàng này không?

# kdsOrderReceived
source: Order Received
ko: 주문 접수
vi: Đã nhận đơn

# kdsPreparationStarted
source: Preparation Started
ko: 조리 시작
vi: Bắt đầu chuẩn bị

# kdsPreparationComplete
source: Preparation Complete
ko: 조리 완료
vi: Chuẩn bị xong

# kdsServingComplete
source: Serving Complete
ko: 서빙 완료
vi: Hoàn thành phục vụ

# kdsOrderCancelled
source: Order Cancelled
ko: 취소됨
vi: Đã hủy

# kdsStartPreparation
source: Start Preparation
ko: 조리 시작
vi: Bắt đầu chuẩn bị

# kdsMarkAsReady
source: Mark as Ready
ko: 조리 완료
vi: Đánh dấu sẵn sàng

# kdsMarkAsServed
source: Mark as Served
ko: 서빙 완료
vi: Đánh dấu đã phục vụ

# kdsElapsedMinutes
source: {minutes} min elapsed
ko: {minutes} 분 경과
vi: Đã trôi qua {minutes} phút

# kdsTableNumber
source: Table Number
ko: 테이블 번호
vi: Số bàn

# kdsSpecialInstructions
source: Special Instructions
ko: 특별 지시사항
vi: Hướng dẫn đặc biệt

source: Daily Closing
vi: Đóng quỹ hàng ngày

source: Closing History
vi: Lịch sử đóng quỹ

source: Closing Summary
vi: Tóm tắt đóng quỹ

source: Select Closing Date
vi: Chọn ngày đóng quỹ

source: Select Date
vi: Chọn ngày

source: Sales Aggregation
vi: Tổng hợp doanh thu

source: Total Transactions
vi: Tổng số giao dịch

# transactionsCount
source: {count} transactions
vi: {count} giao dịch

source: Cash Count
vi: Kiểm quỹ

source: Expected Cash
vi: Tiền mặt dự kiến

source: Actual Cash
vi: Tiền mặt thực tế

source: Cash Difference
vi: Chênh lệch tiền mặt

source: Enter Actual Cash
vi: Nhập tiền mặt thực tế

# actualCashHint
source: Enter the actual cash amount
vi: Nhập số tiền mặt thực tế

# cashDifferenceAcceptable
source: Exceeds acceptable range (±$10)
vi: Vượt quá phạm vi cho phép (±10.000₫)

source: Special Notes
vi: Ghi chú đặc biệt

# notesPlaceholder
source: Enter any special notes
vi: Nhập ghi chú đặc biệt nếu có

source: Perform Closing
vi: Thực hiện đóng quỹ

# skipCashCount
source: Close Without Cash Count
vi: Đóng quỹ không kiểm tiền

# closingComplete
source: Closing completed successfully
vi: Đóng quỹ hoàn tất

# closingFailed
source: An error occurred during closing
vi: Đã xảy ra lỗi khi đóng quỹ

source: Loading closing data...
vi: Đang tải dữ liệu đóng quỹ...

source: No closing history
vi: Không có lịch sử đóng quỹ

# loadClosingHistoryFailed
source: Unable to load closing history
vi: Không thể tải lịch sử đóng quỹ

# tryAgainLater
source: Please try again later
vi: Vui lòng thử lại sau

source: Select Period
vi: Chọn kỳ

source: View Details
vi: Xem chi tiết

source: Generate PDF
vi: Tạo PDF

# savePdfQuestion
source: Would you like to save {reportName} as PDF?
vi: Bạn có muốn lưu {reportName} dưới dạng PDF không?

source: Generate
vi: Tạo

# editActualCash
source: Edit {label}
vi: Sửa {label}

source: Closing Details
vi: Chi tiết đóng quỹ

source: Closing Time
vi: Thời gian đóng quỹ

source: Assigned Employee
vi: Người phụ trách

source: Unknown
vi: Không rõ

source: Average Transaction
vi: Trung bình mỗi giao dịch

# taxTotal
source: Total Tax
vi: Tổng thuế

# discountTotal
source: Total Discount
vi: Tổng giảm giá

# normalCashDifference
source: Within Range
vi: Trong phạm vi

# pdfSaved
source: PDF saved: {path}
vi: Đã lưu PDF: {path}

# pdfGenerationFailed
source: PDF generation failed: {error}
vi: Tạo PDF thất bại: {error}

# alreadyClosed
source: This date has already been closed
vi: Ngày này đã được đóng quỹ

# cannotCloseFutureDate
source: Cannot close future dates
vi: Không thể đóng quỹ cho ngày tương lai

# noSalesForDate
source: No sales found for this date
vi: Không có doanh thu cho ngày này

source: Login required
vi: Yêu cầu đăng nhập

# closingProcessError
source: An error occurred during closing. Please try again later
vi: Đã xảy ra lỗi khi đóng quỹ. Vui lòng thử lại sau

source: Daily Closing Report
vi: Báo cáo đóng quỹ hàng ngày

# closingInfo
source: Closing Information
vi: Thông tin đóng quỹ

source: Closing Date
vi: Ngày đóng quỹ

source: Payment Method Breakdown
vi: Phân tích theo phương thức

# qrPaymentSales
source: QR Payment
vi: Thanh toán QR

# transferSales
source: Transfer
vi: Chuyển khoản

source: Cash Reconciliation
vi: Đối chiếu tiền mặt

# signatureSection
source: Signatures
vi: Chữ ký

source: Closing Manager
vi: Người đóng quỹ

source: Verifier
vi: Người xác nhận

source: Signature
vi: Chữ ký

source: User Guide
vi: Hướng dẫn sử dụng

source: Tutorial
vi: Hướng dẫn

# tutorialSkip
source: Skip
vi: Bỏ qua

# tutorialNext
source: Next
vi: Tiếp theo

# tutorialPrevious
source: Previous
vi: Trước

# tutorialFinish
source: Finish
vi: Hoàn thành

# tutorialDontShowAgain
source: Don't show again
vi: Không hiện lại

# tutorial_daily_closing_welcome_title
source: Welcome to Daily Closing
vi: Chào mừng đến với Đóng quỹ hàng ngày

# tutorial_daily_closing_welcome_desc
source: Use Daily Closing to reconcile and record your daily sales. Let's start with a quick guide.
vi: Sử dụng Đóng quỹ hàng ngày để đối chiếu và ghi lại doanh thu trong ngày. Hãy bắt đầu với hướng dẫn nhanh.

# tutorial_daily_closing_date_title
source: Select Closing Date
vi: Chọn ngày đóng quỹ

# tutorial_daily_closing_date_desc
source: Tap here to select the date you want to close. Today's date is selected by default.
vi: Nhấn vào đây để chọn ngày bạn muốn đóng quỹ. Ngày hôm nay được chọn mặc định.

# tutorial_daily_closing_summary_title
source: Sales Summary
vi: Tóm tắt doanh thu

# tutorial_daily_closing_summary_desc
source: This card shows total transactions, total sales, average transaction, taxes, and discounts.
vi: Thẻ này hiển thị tổng giao dịch, tổng doanh thu, trung bình mỗi giao dịch, thuế và giảm giá.

# tutorial_daily_closing_payment_title
source: Payment Method Breakdown
vi: Phân tích theo phương thức thanh toán

# tutorial_daily_closing_payment_desc
source: View sales breakdown by payment method: cash, card, QR payment, and transfer.
vi: Xem doanh thu theo từng phương thức: tiền mặt, thẻ, thanh toán QR và chuyển khoản.

# tutorial_daily_closing_cash_title
source: Cash Reconciliation
vi: Đối chiếu tiền mặt

# tutorial_daily_closing_cash_desc
source: Compare expected cash sales with actual cash count to verify differences.
vi: So sánh tiền mặt dự kiến với số tiền mặt thực tế để xác minh chênh lệch.

# tutorial_daily_closing_actual_cash_title
source: Enter Actual Cash
vi: Nhập tiền mặt thực tế

# tutorial_daily_closing_actual_cash_desc
source: Tap this button to enter the actual cash amount you counted. The system will verify if the difference is within acceptable range.
vi: Nhấn nút này để nhập số tiền mặt thực tế bạn đã đếm. Hệ thống sẽ xác minh xem chênh lệch có trong phạm vi chấp nhận được không.

# tutorial_daily_closing_notes_title
source: Record Special Notes
vi: Ghi chú đặc biệt

# tutorial_daily_closing_notes_desc
source: You can add notes about special occurrences during closing, such as refunds or shortages.
vi: Bạn có thể thêm ghi chú về các sự kiện đặc biệt khi đóng quỹ, chẳng hạn như hoàn tiền hoặc thiếu hụt.

# tutorial_daily_closing_perform_title
source: Perform Closing
vi: Thực hiện đóng quỹ

# tutorial_daily_closing_perform_desc
source: After verifying all information, tap this button to complete the closing. Note: Closing cannot be undone.
vi: Sau khi xác minh tất cả thông tin, nhấn nút này để hoàn tất đóng quỹ. Lưu ý: Không thể hoàn tác đóng quỹ.

# tutorial_daily_closing_history_title
source: Closing History
vi: Lịch sử đóng quỹ

# tutorial_daily_closing_history_desc
source: View previous closing records and download them as PDF reports.
vi: Xem các bản ghi đóng quỹ trước đó và tải xuống dưới dạng báo cáo PDF.

source: Reservations
vi: Đặt chỗ

source: Add Reservation
vi: Thêm đặt chỗ

source: Reservation Detail
vi: Chi tiết đặt chỗ

source: Delete Reservation
vi: Xóa đặt chỗ

# deleteReservationConfirm
source: Are you sure you want to delete the reservation for {customer}?
vi: Bạn có chắc chắn muốn xóa đặt chỗ của {customer}?

source: Reservation deleted
vi: Đã xóa đặt chỗ

source: No reservations
vi: Không có đặt chỗ

# reservationStatusChanged
source: Reservation status changed to {status}
vi: Trạng thái đặt chỗ đã thay đổi thành {status}

# reservationPending
source: Pending
vi: Chờ xử lý

# reservationConfirmed
source: Confirmed
vi: Đã xác nhận

# reservationSeated
source: Seated
vi: Đã ngồi

# reservationCancelled
source: Cancelled
vi: Đã hủy

# reservationNoShow
source: No Show
vi: Không đến

source: Confirmed
vi: Đã xác nhận

source: Pending
vi: Chờ xử lý

source: Customer Name
vi: Tên khách hàng

# customerPhone
source: Contact
vi: Liên hệ

source: Party Size
vi: Số người

source: Table
vi: Bàn

# partySizePeople
source: {count} people
vi: {count} người

source: Reservation Date
vi: Ngày đặt chỗ

source: Reservation Time
vi: Giờ đặt chỗ

source: Special Requests
vi: Yêu cầu đặc biệt

source: Special Requests (Optional)
vi: Yêu cầu đặc biệt (Tùy chọn)

source: Created At
vi: Tạo lúc

# allReservations
source: All
vi: Tất cả

# errorOccurredWithMessage
source: Error occurred: {message}
vi: Đã xảy ra lỗi: {message}

source: Edit Reservation
vi: Chỉnh sửa đặt chỗ

# customerNameRequired
source: Please enter customer name
vi: Vui lòng nhập tên khách hàng

# customerPhoneRequired
source: Please enter contact number
vi: Vui lòng nhập số liên hệ

# partySizeRequired
source: Please enter party size
vi: Vui lòng nhập số người

# partySizeInvalid
source: Party size must be at least 1
vi: Số người phải ít nhất là 1

source: people
vi: người

# appName
source: Oda POS
ko: 오다 POS

source: OK
ko: 확인

# customerEmailLabel
source: Email
ko: 이메일

# piecesUnit
source: {count}
ko: {count}개
