Repository: afgmen/Odaai-POS-v1
Catalog: lib/l10n/app_*.arb
Languages: ko, vi

source: Cancel
ko: 취소
vi: Hủy

source: Save
ko: 저장
vi: Lưu

source: Delete
ko: 삭제
vi: Xóa

source: Edit
ko: 수정
vi: Sửa

source: Add
ko: 추가
vi: Thêm

source: Search
ko: 검색
vi: Tìm kiếm

source: Settings
ko: 설정
vi: Cài đặt

source: Close
ko: 닫기
vi: Đóng

source: Confirm
ko: 확인
vi: Xác nhận

source: Back
ko: 뒤로
vi: Quay lại

source: Error
ko: 오류
vi: Lỗi

source: Loading...
ko: 로딩 중...
vi: Đang tải...

source: No Data
ko: 데이터 없음
vi: Không có dữ liệu

source: Retry
ko: 재시도
vi: Thử lại

source: Yes
ko: 예
vi: Có

source: No
ko: 아니오
vi: Không

source: More
ko: 더보기
vi: Thêm

source: All
ko: 전체
vi: Tất cả

source: Today
ko: 오늘
vi: Hôm nay

source: Yesterday
ko: 어제
vi: Hôm qua

source: Week
vi: Tuần

source: Month
vi: Tháng

# customPeriod
source: Custom
vi: Tùy chọn

source: None
ko: 없음
vi: Không có

source: Apply
ko: 적용
vi: Áp dụng

source: Activate
ko: 활성화
vi: Kích hoạt

source: Deactivate
ko: 비활성화
vi: Vô hiệu hóa

# navProducts
source: Products
ko: 상품관리
vi: Sản phẩm

# navSales
source: Sales
ko: 주문내역
vi: Bán hàng

# navDashboard
source: Dashboard
ko: 대시보드
vi: Bảng điều khiển

# navInventory
source: Low Stock
ko: 재고부족
vi: Tồn kho thấp

# navEmployees
source: Employees
ko: 직원관리
vi: Nhân viên

# navPromotions
source: Promotions
ko: 프로모션
vi: Khuyến mãi

# navReports
source: Reports
ko: 리포트
vi: Báo cáo

# navSettings
source: Settings
ko: 설정
vi: Cài đặt

# navCustomers
source: Customers
ko: 고객
vi: Khách hàng

# navTables
source: Tables
ko: 테이블
vi: Bàn

# navRefunds
source: Refunds
ko: 환불
vi: Hoàn tiền

# navCashDrawer
source: Cash
ko: 시재
vi: Quỹ

# navKds
source: Kitchen
vi: Bếp

# navDailyClosing
source: Daily Closing
vi: Chốt ca

source: Cart
ko: 장바구니
vi: Giỏ hàng

source: Subtotal
ko: 소계
vi: Tạm tính

source: Discount
ko: 할인
vi: Giảm giá

source: Total
ko: 합계
vi: Tổng cộng

source: Checkout
ko: 결제
vi: Thanh toán

# clearCart
source: Clear
ko: 초기화
vi: Xóa

source: Add Discount
ko: 할인 추가
vi: Thêm giảm giá

source: Apply Promotion
ko: 프로모션 적용
vi: Áp dụng khuyến mãi

source: Auto Promotions Applied
ko: 자동 적용된 프로모션
vi: Khuyến mãi tự động

# cartEmpty
source: Your cart is empty
ko: 장바구니가 비어있습니다
vi: Giỏ hàng trống

# addProductsPlease
source: Add products to cart
ko: 상품을 추가해주세요
vi: Vui lòng thêm sản phẩm

source: Pay {amount}
ko: 결제 {amount}
vi: Thanh toán {amount}

source: Discount Settings
ko: 할인 설정
vi: Cài đặt giảm giá

source: Promotion
ko: 프로모션
vi: Khuyến mãi

source: Payment Amount
ko: 결제금액
vi: Số tiền thanh toán

# itemCount
source: {count} items
ko: {count}개
vi: {count} món

# appliedProducts
source: Select Products
ko: 적용 상품 선택
vi: Chọn sản phẩm

source: Product Name
ko: 상품명
vi: Tên sản phẩm

# productPrice
source: Price
ko: 가격
vi: Giá

# productStock
source: Stock
ko: 재고
vi: Tồn kho

# productCategory
source: Category
ko: 카테고리
vi: Danh mục

source: Add Product
ko: 상품 추가
vi: Thêm sản phẩm

source: Edit Product
ko: 상품 수정
vi: Sửa sản phẩm

source: Delete Product
ko: 상품 삭제
vi: Xóa sản phẩm

source: Product Management
ko: 상품 관리
vi: Quản lý sản phẩm

# noProducts
source: No products found
ko: 상품이 없습니다
vi: Không có sản phẩm

# searchProductHint
source: Search by name, SKU, barcode...
ko: 상품명, SKU, 바코드 검색...
vi: Tìm theo tên, SKU, mã vạch...

# addedToCart
source: {name} added to cart
ko: {name}을(를) 장바구니에 추가했습니다
vi: Đã thêm {name} vào giỏ hàng

# outOfStock
source: {name} is out of stock
ko: {name}은(는) 현재 품절 중입니다
vi: {name} đã hết hàng

# outOfStockBadge
source: Out of Stock
vi: Hết hàng

# lowStockBadge
source: Low Stock
vi: Sắp hết

# productNotFound
source: [{input}] Product not found
ko: [{input}] 상품을 찾을 수 없습니다
vi: [{input}] Không tìm thấy sản phẩm

source: Payment Method
ko: 결제 방법
vi: Phương thức thanh toán

source: Cash
ko: 현금
vi: Tiền mặt

source: Card
ko: 카드
vi: Thẻ

# qr
source: QR Code
ko: QR
vi: Mã QR

source: Transfer
ko: 이체
vi: Chuyển khoản

source: Cash Received
ko: 받은 금액
vi: Tiền nhận

source: Change
ko: 거스름돈
vi: Tiền thừa

source: Payment Complete
ko: 결제 완료
vi: Thanh toán thành công

source: Select Payment Method
ko: 결제 방법 선택
vi: Chọn phương thức thanh toán

# cashInputAmount
source: Cash Amount
ko: 현금 투입 금액
vi: Số tiền mặt

source: Enter amount
ko: 금액 입력
vi: Nhập số tiền

source: No employee logged in
ko: 로그인한 직원이 없습니다
vi: Chưa đăng nhập nhân viên

source: Payment Failed
ko: 결제 실패
vi: Thanh toán thất bại

# receiptNumber
source: Receipt #
ko: 영수증 번호
vi: Số hóa đơn

# receiptDate
source: Date
ko: 일시
vi: Ngày

# receiptItems
source: Items
ko: 항목
vi: Mặt hàng

# receiptThankYou
source: Thank you for your purchase!
ko: 감사합니다!
vi: Cảm ơn quý khách!

# settingsLanguage
source: Language
ko: 언어
vi: Ngôn ngữ

# settingsCurrency
source: Currency
ko: 통화
vi: Tiền tệ

# settingsExchangeRate
source: Exchange Rate
ko: 환율
vi: Tỷ giá

# settingsSelectLanguage
source: Select Language
ko: 언어 선택
vi: Chọn ngôn ngữ

# settingsSelectCurrency
source: Select Currency
ko: 통화 선택
vi: Chọn tiền tệ

# localeSettings
source: Language & Currency
ko: 언어 및 통화
vi: Ngôn ngữ & Tiền tệ

# storeInfo
source: Store Information
ko: 매장 정보
vi: Thông tin cửa hàng

source: Store Name
ko: 매장명
vi: Tên cửa hàng

# storePhone
source: Phone
ko: 전화번호
vi: Số điện thoại

# storeAddress
source: Address
ko: 주소
vi: Địa chỉ

source: Receipt Settings
ko: 영수증 설정
vi: Cài đặt hóa đơn

source: Footer Message
ko: 하단 문구
vi: Tin nhắn cuối

# footerDefault
source: Thank you!
ko: 감사합니다!
vi: Cảm ơn!

source: Show QR Code
ko: QR 코드 표시
vi: Hiển thị mã QR

# appInfo
source: App Information
ko: 앱 정보
vi: Thông tin ứng dụng

source: Version
ko: 버전
vi: Phiên bản

source: Database
ko: 데이터베이스
vi: Cơ sở dữ liệu

source: Sync Mode
ko: 동기화 모드
vi: Chế độ đồng bộ

source: Offline-First
ko: 오프라인 우선
vi: Ngoại tuyến

source: Logout
ko: 로그아웃
vi: Đăng xuất

# logoutConfirm
source: Are you sure you want to logout?
ko: 로그아웃 하시겠습니까?
vi: Bạn có chắc muốn đăng xuất?

# currencyUSD
source: US Dollar ($)
ko: 달러 ($)
vi: Đô la Mỹ ($)

# currencyVND
source: Vietnamese Dong (₫)
ko: 동 (₫)
vi: Đồng Việt Nam (₫)

source: Employee Management
ko: 직원 관리
vi: Quản lý nhân viên

source: Employee Login
vi: Đăng nhập nhân viên

source: Select Employee
vi: Chọn nhân viên

source: Enter PIN Code
vi: Nhập mã PIN

source: No employees registered
vi: Chưa có nhân viên đăng ký

# forgotPin
source: Forgot your PIN? Contact manager
vi: Quên mã PIN? Liên hệ quản lý

# loginButton
source: Login
vi: Đăng nhập

# loginFailed
source: Login failed: {error}
vi: Đăng nhập thất bại: {error}

# employeeName
source: Name
ko: 이름
vi: Tên

# employeeRole
source: Role
ko: 역할
vi: Vai trò

# employeeUsername
source: Username
ko: 사용자명
vi: Tên người dùng

# employeePin
source: PIN
vi: Mã PIN

source: Add Employee
ko: 직원 추가
vi: Thêm nhân viên

source: Edit Employee
ko: 직원 수정
vi: Sửa nhân viên

# noEmployees
source: No employees found
ko: 등록된 직원이 없습니다
vi: Không tìm thấy nhân viên

# employeeLoadError
source: Failed to load employee list
ko: 직원 목록을 불러올 수 없습니다
vi: Không thể tải danh sách nhân viên

# employeeAdded
source: New employee added
ko: 새 직원이 추가되었습니다
vi: Đã thêm nhân viên mới

# employeeUpdated
source: Employee info updated
ko: 직원 정보가 수정되었습니다
vi: Đã cập nhật thông tin nhân viên

# usernameLabel
source: Username (Login ID)
ko: 사용자명 (로그인 ID)
vi: Tên người dùng (ID đăng nhập)

# usernameHint
source: e.g. john_doe
ko: 예: john_doe
vi: VD: john_doe

# usernameRequired
source: Please enter username
ko: 사용자명을 입력하세요
vi: Vui lòng nhập tên người dùng

# usernameMinLength
source: Username must be at least 3 characters
ko: 사용자명은 3자 이상이어야 합니다
vi: Tên người dùng phải có ít nhất 3 ký tự

# nameLabel
source: Name
ko: 이름
vi: Tên

# nameHint
source: e.g. John Doe
ko: 예: 홍길동
vi: VD: Nguyễn Văn A

# nameRequired
source: Please enter name
ko: 이름을 입력하세요
vi: Vui lòng nhập tên

# roleLabel
source: Role
ko: 역할
vi: Vai trò

# roleCashier
source: Cashier
ko: 캐셔 (Cashier)
vi: Thu ngân

# roleManager
source: Manager
ko: 매니저 (Manager)
vi: Quản lý

# roleAdmin
source: Admin
ko: 관리자 (Admin)
vi: Quản trị viên

# roleKitchen
source: Kitchen
vi: Nhà bếp

# pinChangeLabel
source: Change PIN (optional)
ko: PIN 변경 (선택사항)
vi: Đổi PIN (tùy chọn)

# pinNewLabel
source: PIN (4 digits)
ko: PIN (4자리 숫자)
vi: PIN (4 chữ số)

# pinNoChangeHelper
source: Leave empty to keep current PIN
ko: 비워두면 PIN이 변경되지 않습니다
vi: Bỏ trống để giữ PIN hiện tại

# pinNewHelper
source: Enter 4 digits
ko: 4자리 숫자를 입력하세요
vi: Nhập 4 chữ số

# pinRequired
source: Please enter PIN
ko: PIN을 입력하세요
vi: Vui lòng nhập PIN

# pinLengthError
source: PIN must be 4 digits
ko: PIN은 4자리여야 합니다
vi: PIN phải có 4 chữ số

# pinDigitsOnly
source: PIN must contain only numbers
ko: PIN은 숫자만 입력 가능합니다
vi: PIN chỉ được chứa số

source: Promotion Management
ko: 프로모션 관리
vi: Quản lý khuyến mãi

source: Promotion Name
ko: 프로모션명
vi: Tên khuyến mãi

# promotionType
source: Type
ko: 타입
vi: Loại

# promotionValue
source: Value
ko: 값
vi: Giá trị

source: Add Promotion
ko: 프로모션 추가
vi: Thêm khuyến mãi

source: Edit Promotion
ko: 프로모션 수정
vi: Sửa khuyến mãi

# noPromotions
source: No promotions found
ko: 등록된 프로모션이 없습니다
vi: Không có khuyến mãi

source: Delete Promotion
ko: 프로모션 삭제
vi: Xóa khuyến mãi

# deletePromotionConfirm
source: Are you sure you want to delete "{name}"?
ko: 정말로 "{name}" 프로모션을 삭제하시겠습니까?
vi: Bạn có chắc muốn xóa "{name}"?

# promotionNameLabel
source: Promotion Name
ko: 프로모션 이름
vi: Tên khuyến mãi

# promotionNameHint
source: e.g. Orange Juice BOGO
ko: 예: 오렌지주스 1+1
vi: VD: Nước cam mua 1 tặng 1

# promotionNameRequired
source: Please enter promotion name
ko: 프로모션 이름을 입력하세요
vi: Vui lòng nhập tên khuyến mãi

# promotionTypeLabel
source: Promotion Type
ko: 프로모션 타입
vi: Loại khuyến mãi

# typeBogo
source: Buy 1 Get 1 Free
ko: 1+1 이벤트 (1개 사면 1개 무료)
vi: Mua 1 tặng 1

# typeBuy2Get1
source: Buy 2 Get 1 Free
ko: 2+1 이벤트 (2개 사면 1개 무료)
vi: Mua 2 tặng 1

# typePercentOff
source: Percent Off
ko: 퍼센트 할인
vi: Giảm phần trăm

# typeAmountOff
source: Amount Off
ko: 금액 할인
vi: Giảm số tiền

# discountRateLabel
source: Discount Rate (%)
ko: 할인율 (%)
vi: Tỷ lệ giảm (%)

# discountAmountLabel
source: Discount Amount
ko: 할인 금액 (원)
vi: Số tiền giảm

# discountValueHint
source: e.g. 10
ko: 예: 10
vi: VD: 10

# discountAmountHint
source: e.g. 1000
ko: 예: 1000
vi: VD: 1000

# discountValueRequired
source: Please enter discount value
ko: 할인 값을 입력하세요
vi: Vui lòng nhập giá trị giảm giá

# invalidNumber
source: Please enter a valid number
ko: 올바른 숫자를 입력하세요
vi: Vui lòng nhập số hợp lệ

# maxDiscountRate
source: Discount rate cannot exceed 100%
ko: 할인율은 100% 이하여야 합니다
vi: Tỷ lệ giảm không quá 100%

source: Start Date
ko: 시작일
vi: Ngày bắt đầu

source: End Date
ko: 종료일
vi: Ngày kết thúc

# targetProduct
source: Target Product (optional)
ko: 적용 상품 (선택사항)
vi: Sản phẩm áp dụng (tùy chọn)

source: All Products
ko: 전체 상품
vi: Tất cả sản phẩm

# productLoadFailed
source: Failed to load products
ko: 상품 로드 실패
vi: Không thể tải sản phẩm

source: No Selection
ko: 선택 안 함
vi: Không chọn

# bogoLabel
source: Buy 1 Get 1
ko: 1+1 이벤트
vi: Mua 1 tặng 1

# buy2Get1Label
source: Buy 2 Get 1
ko: 2+1 이벤트
vi: Mua 2 tặng 1

# percentOffLabel
source: % Off
ko: 퍼센트 할인
vi: Giảm %

# amountOffLabel
source: Amount Off
ko: 금액 할인
vi: Giảm tiền

# freeOne
source: 1 Free
ko: 1개 무료
vi: 1 miễn phí

source: Dashboard
ko: 대시보드
vi: Bảng điều khiển

# todaySales
source: Today's Sales
ko: 오늘 매출
vi: Doanh thu hôm nay

source: Total Revenue
ko: 총 수익
vi: Tổng doanh thu

source: Top Products
ko: 인기 상품
vi: Sản phẩm hàng đầu

source: Sales Dashboard
ko: 매출 대시보드
vi: Bảng điều khiển bán hàng

# paymentMethodSales
source: Sales by Payment Method
ko: 결제 방법별 매출
vi: Doanh thu theo phương thức

# productRanking
source: Product Sales Ranking
ko: 상품별 매출 순위
vi: Xếp hạng sản phẩm

# totalSalesAmount
source: Total Sales
ko: 매출 합계
vi: Tổng doanh thu

source: Total Sales
vi: Tổng doanh thu

# orderCount
source: Orders
ko: 주문 수
vi: Đơn hàng

# orderUnit
source: orders
ko: 건
vi: đơn

source: Avg. Order Amount
ko: 평균 주문금액
vi: Giá trị TB/đơn

source: Inventory Value
ko: 재고 가치
vi: Giá trị tồn kho

# inventoryValueDesc
source: Total value of current inventory
ko: 현재 보유 재고 총 가치
vi: Tổng giá trị hàng tồn kho hiện tại

source: No sales data
ko: 판매 데이터 없음
vi: Không có dữ liệu bán hàng

# soldCount
source: {count} sold
ko: {count}개 판매
vi: Đã bán {count}

# errorOccurred
source: Error occurred: {error}
ko: 오류 발생
vi: Lỗi xảy ra: {error}

source: Sales History
ko: 주문내역
vi: Lịch sử bán hàng

# noSalesHistory
source: No sales records
ko: 주문 기록이 없습니다
vi: Không có lịch sử bán hàng

source: Total {amount}
ko: 합계 {amount}
vi: Tổng {amount}

source: Refunded
ko: 환불
vi: Đã hoàn tiền

# dateMonth
source: {month}/{day}
ko: {month}월 {day}일
vi: {day}/{month}

source: Low Stock Alert
ko: 재고 부족 알림
vi: Cảnh báo tồn kho thấp

# allStockSufficient
source: All products have sufficient stock
ko: 모든 상품의 재고가 충분합니다
vi: Tất cả sản phẩm đủ hàng

# aboveMinStock
source: Stock levels are above minimum
ko: 최소 재고 이상으로 유지되고 있습니다
vi: Tồn kho trên mức tối thiểu

# addStockTitle
source: Add Stock: {name}
ko: 재고 추가: {name}
vi: Thêm hàng: {name}

# currentStock
source: Current: {current} / Min: {min}
ko: 현재 재고: {current} / 최소 재고: {min}
vi: Hiện tại: {current} / Tối thiểu: {min}

source: Add Stock
ko: 재고 추가
vi: Thêm hàng

# stockReplenishReason
source: Stock replenishment (low stock alert)
ko: 재고 보충 (부족 알림)
vi: Bổ sung hàng (cảnh báo tồn kho)

# stockAddedMsg
source: Added {qty} units of {name}
ko: {name} 재고 {qty}개 추가 완료
vi: Đã thêm {qty} đơn vị {name}

# outOfStockLabel
source: Out of Stock
ko: 재고 없음
vi: Hết hàng

# lowStockLabel
source: Low
ko: 부족
vi: Thấp

# currentStockLabel
source: Current Stock
ko: 현재 재고
vi: Tồn kho hiện tại

# minStockLabel
source: Min Stock
ko: 최소 재고
vi: Tồn kho tối thiểu

source: Need Replenish
ko: 필요 보충
vi: Cần bổ sung

source: Sales Report
ko: 매출 리포트
vi: Báo cáo bán hàng

source: Sales Trend
vi: Xu hướng bán hàng

source: No data available
vi: Không có dữ liệu

source: Export Excel
ko: 엑셀 내보내기
vi: Xuất Excel

# excelSaved
source: Excel saved: {path}
ko: 엑셀 파일 저장됨: {path}
vi: Đã lưu Excel: {path}

# exportFailed
source: Export failed: {error}
ko: 내보내기 실패: {error}
vi: Xuất thất bại: {error}

source: Customer Management
ko: 고객 관리
vi: Quản lý khách hàng

source: Add Customer
ko: 고객 추가
vi: Thêm khách hàng

source: Edit Customer
ko: 고객 수정
vi: Sửa khách hàng

# searchCustomerHint
source: Search by name, phone, email...
ko: 이름, 전화번호, 이메일 검색...
vi: Tìm theo tên, SĐT, email...

# noCustomers
source: No customers found
ko: 등록된 고객이 없습니다
vi: Không có khách hàng

# noSearchResult
source: No search results
ko: 검색 결과가 없습니다
vi: Không có kết quả

source: Points
ko: 포인트
vi: Điểm

# earnPoints
source: Earn
ko: 적립
vi: Tích

# usePoints
source: Use
ko: 사용
vi: Dùng

source: Purchase History
ko: 구매 이력
vi: Lịch sử mua hàng

source: No purchase history
ko: 구매 이력이 없습니다
vi: Chưa có lịch sử mua hàng

# earnPointsTitle
source: Earn Points
ko: 포인트 적립
vi: Tích điểm

# usePointsTitle
source: Use Points
ko: 포인트 사용
vi: Dùng điểm

# pointsLabel
source: Points
ko: 포인트
vi: Điểm

# earnPointsHint
source: Points to earn
ko: 적립할 포인트
vi: Điểm muốn tích

# usePointsHint
source: Points to use (balance: {points}P)
ko: 사용할 포인트 (보유: {points}P)
vi: Điểm muốn dùng (hiện có: {points}P)

# customerNameLabel
source: Name *
ko: 이름 *
vi: Tên *

# customerPhoneLabel
source: Phone
ko: 전화번호
vi: Số điện thoại

# customerNoteLabel
source: Notes
ko: 메모
vi: Ghi chú

source: Table Management
ko: 테이블 관리
vi: Quản lý bàn

source: Table Layout
vi: Bố trí bàn

source: Reservation Management
vi: Quản lý đặt chỗ

source: Add Table
ko: 테이블 추가
vi: Thêm bàn

# noTables
source: No tables available
ko: 테이블을 추가해주세요
vi: Không có bàn

source: Empty Tables
vi: Bàn trống

# occupiedTables
source: Occupied
vi: Đang sử dụng

# allTables
source: All
vi: Tất cả

# noTablesFiltered
source: No tables with this status
ko: 해당 상태의 테이블이 없습니다
vi: Không có bàn với trạng thái này

# tableAvailable
source: Available
ko: 비어있음
vi: Trống

# tableOccupied
source: Occupied
ko: 사용중
vi: Đang dùng

# tableReserved
source: Reserved
ko: 예약
vi: Đã đặt

# tableSeated
source: Seated
vi: Đang ngồi

# tablePaymentComplete
source: Payment Complete
vi: Đã thanh toán

# tableCleaning
source: Cleaning
vi: Đang dọn

# tableNameLabel
source: Table Name *
ko: 테이블 이름 *
vi: Tên bàn *

source: Table Number
vi: Số bàn

# tableNumberHint
source: e.g. 1, A1, VIP-1
vi: VD: 1, A1, VIP-1

# tableNumberRequired
source: Please enter table number
vi: Vui lòng nhập số bàn

# tableAdded
source: Table {number} added
vi: Đã thêm bàn {number}

# editTable
source: Edit Table {number}
vi: Sửa bàn {number}

source: Delete Table
vi: Xóa bàn

# deleteTableConfirm
source: Do you want to delete table {number}?
vi: Bạn có muốn xóa bàn {number} không?

# tableDeleted
source: Table {number} deleted
vi: Đã xóa bàn {number}

# tableUpdated
source: Table {number} updated
vi: Đã cập nhật bàn {number}

# tableNameHint
source: e.g. Table 1, A-1
ko: 예: 테이블 1, A-1
vi: VD: Bàn 1, A-1

# seatsLabel
source: Seats
ko: 좌석 수
vi: Số ghế

# seatsCount
source: Seats
vi: Số ghế

# zoneLabel
source: Zone
ko: 구역
vi: Khu vực

# zoneHint
source: e.g. Hall, Terrace, Room
ko: 예: 홀, 테라스, 룸
vi: VD: Sảnh, Sân thượng, Phòng

source: Start Use
ko: 사용 시작
vi: Bắt đầu

source: Reserve
ko: 예약
vi: Đặt chỗ

# clearTable
source: Clear (Done)
ko: 비우기 (사용 완료)
vi: Dọn bàn (xong)

source: Move Table
ko: 테이블 이동
vi: Chuyển bàn

# reserveToUse
source: Reserved → Start
ko: 예약 → 사용 시작
vi: Đặt → Sử dụng

# clearTableShort
source: Clear
ko: 비우기
vi: Dọn bàn

# moveTableTitle
source: {name} → Move
ko: {name} → 이동
vi: {name} → Chuyển

# noEmptyTables
source: No empty tables available.
ko: 이동 가능한 빈 테이블이 없습니다.
vi: Không có bàn trống.

# seatsUnit
source: {count} seats
ko: {count}석
vi: {count} ghế

# refundManagement
source: Refunds
ko: 환불/반품
vi: Hoàn tiền/Trả hàng

source: Search by Receipt #
ko: 영수증 번호로 검색
vi: Tìm theo số hóa đơn

# receiptNumberHint
source: Enter receipt # (e.g. ODA-20250207-001)
ko: 영수증 번호 입력 (예: ODA-20250207-001)
vi: Nhập số hóa đơn (VD: ODA-20250207-001)

# refundedStatus
source: Refunded
ko: 환불됨
vi: Đã hoàn tiền

# paidStatus
source: Paid
ko: 결제완료
vi: Đã thanh toán

source: Select Refund Items
ko: 환불 항목 선택
vi: Chọn mục hoàn tiền

# refundReasonLabel
source: Refund Reason
ko: 환불 사유
vi: Lý do hoàn tiền

# refundReasonHint
source: Enter refund reason
ko: 환불 사유를 입력하세요
vi: Nhập lý do hoàn tiền

# partialRefund
source: Partial Refund ({amount})
ko: 부분 환불 ({amount})
vi: Hoàn một phần ({amount})

source: Full Refund
ko: 전체 환불
vi: Hoàn toàn bộ

# alreadyRefunded
source: This order has already been refunded.
ko: 이미 환불 처리된 주문입니다.
vi: Đơn hàng đã được hoàn tiền.

# todayRefundHistory
source: Today's Refunds
ko: 오늘 환불 내역
vi: Hoàn tiền hôm nay

# noRefundToday
source: No refunds today
ko: 오늘 환불 내역이 없습니다
vi: Không có hoàn tiền hôm nay

# fullRefundType
source: Full
ko: 전체
vi: Toàn bộ

# partialRefundType
source: Partial
ko: 부분
vi: Một phần

source: Receipt not found
ko: 해당 영수증을 찾을 수 없습니다
vi: Không tìm thấy hóa đơn

source: Full refund complete
ko: 전체 환불이 완료되었습니다
vi: Đã hoàn tiền toàn bộ

source: Partial refund complete
ko: 부분 환불이 완료되었습니다
vi: Đã hoàn tiền một phần

# refundConfirm
source: Proceed with {amount} refund?
ko: {amount} 환불을 진행하시겠습니까?
vi: Hoàn tiền {amount}?

# refundAction
source: Refund
ko: 환불
vi: Hoàn tiền

# cashDrawerManagement
source: Cash Drawer
ko: 시재 관리
vi: Quản lý quỹ

# currentCashDrawer
source: Current Drawer
ko: 현재 시재
vi: Quỹ hiện tại

# openStatus
source: Open
ko: 영업중
vi: Đang mở

# closedStatus
source: Closed
ko: 미개점
vi: Đã đóng

# openDrawer
source: Open
ko: 개점
vi: Mở quỹ

# closeDrawer
source: Close
ko: 마감
vi: Đóng quỹ

source: Deposit
ko: 입금
vi: Nạp tiền

source: Withdraw
ko: 출금
vi: Rút tiền

source: Sale
ko: 매출
vi: Bán hàng

# todayTransactions
source: Today's Transactions
ko: 오늘 거래 내역
vi: Giao dịch hôm nay

source: No transactions today
ko: 오늘 거래 내역이 없습니다
vi: Không có giao dịch hôm nay

# balance
source: Balance {amount}
ko: 잔액 {amount}
vi: Số dư {amount}

# cashDrawerOpen
source: Open
ko: 개점
vi: Mở quỹ

# cashDrawerClose
source: Close
ko: 마감
vi: Đóng quỹ

# cashDrawerDeposit
source: Deposit
ko: 입금
vi: Nạp tiền

# cashDrawerWithdraw
source: Withdraw
ko: 출금
vi: Rút tiền

# cashDrawerSale
source: Sale
ko: 판매
vi: Bán hàng

# cashDrawerRefund
source: Refund
ko: 환불
vi: Hoàn tiền

# amountLabel
source: Amount
ko: 금액
vi: Số tiền

# memoLabel
source: Memo (optional)
ko: 메모 (선택)
vi: Ghi chú (tùy chọn)

source: Close Settlement
ko: 마감 정산
vi: Đóng quỹ cuối ngày

# systemBalance
source: System Balance: {amount}
ko: 시스템 잔액: {amount}
vi: Số dư hệ thống: {amount}

source: Actual Cash Amount
ko: 실제 시재 금액
vi: Số tiền thực tế

# countCashHint
source: Count cash and enter amount
ko: 시재를 세고 금액을 입력하세요
vi: Đếm tiền và nhập số tiền

# normalClose
source: Close Drawer
ko: 정상 마감
vi: Đóng quỹ

# difference
source: Diff: {amount}
ko: 차이: {amount}
vi: Chênh lệch: {amount}

# closeComplete
source: Closed. {note}
ko: 마감 완료. {note}
vi: Đã đóng quỹ. {note}

source: Sync Status
ko: 동기화 상태
vi: Trạng thái đồng bộ

source: Network
ko: 네트워크
vi: Mạng

source: Connected
ko: 연결됨
vi: Đã kết nối

source: Offline
ko: 오프라인
vi: Ngoại tuyến

source: Pending Items
ko: 대기 중 항목
vi: Đang chờ

# pendingCount
source: {count} items
ko: {count}개
vi: {count} mục

source: Last Sync
ko: 마지막 동기화
vi: Đồng bộ cuối

source: Not yet
ko: 아직 없음
vi: Chưa có

source: Syncing...
ko: 동기화 중...
vi: Đang đồng bộ...

source: Sync Now
ko: 지금 동기화
vi: Đồng bộ ngay

# syncAutoMsg
source: Auto-syncs every 5 minutes when connected
ko: 인터넷 연결 시 자동으로 5분마다 동기화됩니다
vi: Tự động đồng bộ 5 phút/lần khi có mạng

# syncOfflineMsg
source: All features work offline. Auto-syncs when connected.
ko: 오프라인 상태에서도 모든 기능을 사용할 수 있습니다. 인터넷 연결 시 자동으로 동기화됩니다.
vi: Tất cả tính năng hoạt động ngoại tuyến. Tự động đồng bộ khi có mạng.

source: Just now
ko: 방금 전
vi: Vừa xong

# minutesAgo
source: {min} min ago
ko: {min}분 전
vi: {min} phút trước

# hoursAgo
source: {hours} hours ago
ko: {hours}시간 전
vi: {hours} giờ trước

# offlineIndicator
source: Offline
ko: 오프라인
vi: Ngoại tuyến

# pinLoginTitle
source: Enter PIN to login
ko: PIN을 입력하여 로그인하세요
vi: Nhập PIN để đăng nhập

# pinMismatch
source: Incorrect PIN
ko: PIN이 일치하지 않습니다
vi: PIN không đúng

# loginError
source: Login error: {error}
ko: 로그인 오류: {error}
vi: Lỗi đăng nhập: {error}

# msgItemAdded
source: Item added to cart
ko: 장바구니에 추가되었습니다
vi: Đã thêm vào giỏ hàng

# msgPaymentSuccess
source: Payment successful
ko: 결제가 완료되었습니다
vi: Thanh toán thành công

# msgPaymentFailed
source: Payment failed
ko: 결제에 실패했습니다
vi: Thanh toán thất bại

# msgInsufficientStock
source: Insufficient stock
ko: 재고가 부족합니다
vi: Không đủ hàng trong kho

# msgInvalidAmount
source: Invalid amount
ko: 잘못된 금액입니다
vi: Số tiền không hợp lệ

# msgSaved
source: Saved successfully
ko: 저장되었습니다
vi: Đã lưu thành công

# msgDeleted
source: Deleted successfully
ko: 삭제되었습니다
vi: Đã xóa thành công

# msgError
source: An error occurred: {error}
ko: 오류가 발생했습니다: {error}
vi: Đã xảy ra lỗi: {error}

source: Quantity
ko: 수량
vi: Số lượng

source: Price
ko: 가격
vi: Giá

source: Amount
ko: 금액
vi: Số tiền

source: Description
ko: 설명
vi: Mô tả

source: Active
ko: 활성
vi: Hoạt động

source: Inactive
ko: 비활성
vi: Không hoạt động

source: Status
ko: 상태
vi: Trạng thái

# cashPayment
source: Cash
ko: 현금
vi: Tiền mặt

# cardPayment
source: Card
ko: 카드
vi: Thẻ

# qrPayment
source: QR Code
ko: QR
vi: Mã QR

# transferPayment
source: Transfer
ko: 이체
vi: Chuyển khoản

# salesLabel
source: Sales
ko: 매출
vi: Bán hàng

# refundLabel
source: Refund
ko: 환불
vi: Hoàn tiền

source: Excel Manage
ko: 엑셀 관리
vi: Quản lý Excel

# excelDownload
source: Download as Excel
ko: 엑셀로 다운로드
vi: Tải xuống Excel

# excelDownloadDesc
source: Export current product list
ko: 현재 상품 목록 내보내기
vi: Xuất danh sách sản phẩm hiện tại

# excelUpload
source: Upload from Excel
ko: 엑셀에서 업로드
vi: Tải lên từ Excel

# excelUploadDesc
source: Add/update products via .xlsx
ko: .xlsx 파일로 상품 추가/수정
vi: Thêm/cập nhật sản phẩm từ .xlsx
